app/controllers/neighborhoods_controller.rb

SELECT  "neighborhoods".* FROM "neighborhoods"  WHERE (name @@ 'Bay' or content @@ 'Bay')  ORDER BY "neighborhoods"."id" ASC LIMIT 1
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "neighborhoods"  LIMIT 25 OFFSET 0) subquery_for_count
---
  def index
    if params[:q].present?
      @results = Search.new(params[:q])
      @neighborhoods = @results.map do |result|
        if result.class == Review
          result.neighborhood
        else
          result
        end
      end
      @neighborhoods.uniq!

      @neighborhoods = Kaminari.paginate_array(@neighborhoods).page(params[:page]).per(10)
    else
      @neighborhoods = Neighborhood.all.page(params[:page])

INSERT INTO "neighborhoods" ("created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-06-26 15:10:51.752788"], ["description", "Way back!"], ["name", "Back Bay"], ["updated_at", "2014-06-26 15:10:51.752788"], ["user_id", 2]]
---
  def create
    @neighborhood = current_user.neighborhoods.build(neighborhood_params)

    if @neighborhood.save

SELECT  "neighborhoods".* FROM "neighborhoods"  WHERE "neighborhoods"."id" = $1 LIMIT 1  [["id", 3]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."neighborhood_id" = $1  ORDER BY "reviews"."upvotes" DESC  [["neighborhood_id", 11]]
---
  def show
    @neighborhood = Neighborhood.find(params[:id])
    @reviews = @neighborhood.reviews.order(upvotes: :desc)